In [66]:
import pandas as pd 
import numpy as np

In [67]:
np.random.seed(101)
data = np.random.randint(0,101,(4,3))
index = ['TX','MD','CA',"NY"]
columns = ['jan','feb','mar']

df = pd.DataFrame(data)
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [68]:
# no comment needed
df = pd.DataFrame(data = data, index = index , columns=columns)
df

    jan  feb  mar
TX   95   11   81
MD   70   63   87
CA   75    9   77
NY   40    4   63

In [70]:
df.info

<bound method DataFrame.info of     jan  feb  mar
TX   95   11   81
MD   70   63   87
CA   75    9   77
NY   40    4   63>

In [ ]:
# pwd (Print Working Directory): Shows the current directory you’re in.
# ls (List): Lists the files and folders in the current directory.

In [95]:
df = pd.read_csv('tips.csv')
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [73]:
df['total_bill'].dtype

dtype('float64')

In [74]:
#subset of the dataset
mycol = ['total_bill','tip']
df[mycol]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [75]:
# add new column to the datset
df['tip_prec'] = 100*df['tip']/ df['total_bill']

In [76]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_prec
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [77]:
# np.round will show spicific number of decimals which you decide
# np.round(the output number , NO. of decimals you want to show).

df['price_per_person'] = np.round(df['total_bill'] / df['size'],2)

In [78]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_prec
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [79]:
# Remeber if you want a permnent ruselts you should assign 
# the the valie to variable 
df= df.drop('tip_prec' , axis=1)

In [80]:
df.shape

(244, 11)

In [86]:
# SET INDEX LABLE FOR THE DATASSET 
df = df.set_index("Payment ID")

In [82]:
# bring back the range index which is 123456....etc
df.reset_index()

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
1,Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
2,Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
3,Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
4,Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...,...
239,Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
240,Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
241,Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
242,Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
243,Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [83]:
# calling the first row numeric lable
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [ ]:
# calling the first row using lable index
df.loc['Sun2959']

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [ ]:
# iloc means integer location 
# rows from NO. 0-4
df.iloc[0:4]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994

In [ ]:
df = df.drop('Sun2959' , axis=0)

KeyError: "['Sun2959'] not found in axis"

In [94]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882

In [96]:
one_row = df.iloc[0]

In [ ]:
# How to add row
df = pd.concat([df, one_row] , ignore_index=True)

In [100]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,0
0,16.99,1.01,Female,No,Sun,Dinner,2.0,8.49,Christy Cunningham,3.560325e+15,Sun2959,NaN
1,10.34,1.66,Male,No,Sun,Dinner,3.0,3.45,Douglas Tucker,4.478071e+15,Sun4608,NaN
2,21.01,3.50,Male,No,Sun,Dinner,3.0,7.00,Travis Walters,6.011812e+15,Sun4458,NaN
3,23.68,3.31,Male,No,Sun,Dinner,2.0,11.84,Nathaniel Harris,4.676138e+15,Sun5260,NaN
4,24.59,3.61,Female,No,Sun,Dinner,4.0,6.15,Tonya Carter,4.832733e+15,Sun2251,NaN

### Conditional Filtering

In [104]:
df[df['total_bill']>40]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,0
59,48.27,6.73,Male,No,Sat,Dinner,4.0,12.07,Brian Ortiz,6.596454e+15,Sat8139,NaN
95,40.17,4.73,Male,Yes,Fri,Dinner,4.0,10.04,Aaron Bentley,1.800266e+14,Fri9628,NaN
102,44.30,2.50,Female,Yes,Sat,Dinner,3.0,14.77,Heather Cohen,3.797711e+14,Sat6240,NaN
142,41.19,5.00,Male,No,Thur,Lunch,5.0,8.24,Eric Andrews,4.356532e+15,Thur3621,NaN
156,48.17,5.00,Male,No,Sun,Dinner,6.0,8.03,Ryan Gonzales,3.523151e+15,Sun7518,NaN
170,50.81,10.00,Male,Yes,Sat,Dinner,3.0,16.94,Gregory Clark,5.473851e+15,Sat1954,NaN
182,45.35,3.50,Male,Yes,Sun,Dinner,3.0,15.12,Jose Parsons,4.112208e+15,Sun2337,NaN
184,40.55,3.00,Male,Yes,Sun,Dinner,2.0,20.27,Stephen Cox,3.547798e+15,Sun5140,NaN
197,43.11,5.00,Female,Yes,Thur,Lunch,4.0,10.78,Brooke Soto,5.544902e+15,Thur9313,NaN
212,48.33,9.00,Male,No,Sat,Dinner,4.0,12.08,Alex Williamson,6.762188e+11,Sat4590,NaN

In [106]:
df[df['sex'] == 'Male']

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,0
1,10.34,1.66,Male,No,Sun,Dinner,3.0,3.45,Douglas Tucker,4.478071e+15,Sun4608,NaN
2,21.01,3.50,Male,No,Sun,Dinner,3.0,7.00,Travis Walters,6.011812e+15,Sun4458,NaN
3,23.68,3.31,Male,No,Sun,Dinner,2.0,11.84,Nathaniel Harris,4.676138e+15,Sun5260,NaN
5,25.29,4.71,Male,No,Sun,Dinner,4.0,6.32,Erik Smith,2.131404e+14,Sun9679,NaN
6,8.77,2.00,Male,No,Sun,Dinner,2.0,4.38,Kristopher Johnson,2.223728e+15,Sun5985,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
236,12.60,1.00,Male,Yes,Sat,Dinner,2.0,6.30,Matthew Myers,3.543676e+15,Sat5032,NaN
237,32.83,1.17,Male,Yes,Sat,Dinner,2.0,16.42,Thomas Brown,4.284723e+15,Sat2929,NaN
239,29.03,5.92,Male,No,Sat,Dinner,3.0,9.68,Michael Avila,5.296069e+15,Sat2657,NaN
241,22.67,2.00,Male,Yes,Sat,Dinner,2.0,11.34,Keith Wong,6.011892e+15,Sat3880,NaN
242,17.82,1.75,Male,No,Sat,Dinner,2.0,8.91,Dennis Dixon,4.375221e+12,Sat17,NaN

In [ ]:
# AND & ----BOTH COND NEED TO BE TRUE 

# OR | --- ONE COND NEED TO BE TRUE

In [107]:
df[ (df['total_bill'] > 30) & (df['sex'] == 'Male') ]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,0
23,39.42,7.58,Male,No,Sat,Dinner,4.0,9.86,Lance Peterson,3.542584e+15,Sat239,NaN
39,31.27,5.00,Male,No,Sat,Dinner,3.0,10.42,Mr. Brandon Berry,6.011526e+15,Sat6373,NaN
44,30.40,5.60,Male,No,Sun,Dinner,4.0,7.60,Todd Cooper,5.038468e+11,Sun2274,NaN
47,32.40,6.00,Male,No,Sun,Dinner,4.0,8.10,James Barnes,3.552003e+15,Sun9677,NaN
56,38.01,3.00,Male,Yes,Sat,Dinner,4.0,9.50,James Christensen DDS,3.497936e+14,Sat8903,NaN
59,48.27,6.73,Male,No,Sat,Dinner,4.0,12.07,Brian Ortiz,6.596454e+15,Sat8139,NaN
83,32.68,5.00,Male,Yes,Thur,Lunch,2.0,16.34,Daniel Murphy,5.356178e+15,Thur8801,NaN
95,40.17,4.73,Male,Yes,Fri,Dinner,4.0,10.04,Aaron Bentley,1.800266e+14,Fri9628,NaN
112,38.07,4.00,Male,No,Sun,Dinner,3.0,12.69,Jeff Lopez,3.572866e+15,Sun591,NaN
141,34.30,6.70,Male,No,Thur,Lunch,6.0,5.72,Steven Carlson,3.526516e+15,Thur1025,NaN
142,41.19,5.00,Male,No,Thur,Lunch,5.0,8.24,Eric Andrews,4.356532e+15,Thur3621,NaN
156,48.17,5.00,Male,No,Sun,Dinner,6.0,8.03,Ryan Gonzales,3.523151e+15,Sun7518,NaN
167,31.71,4.50,Male,No,Sun,Dinner,4.0,7.93,Michael Lawson,3.566286e+15,Sun3719,NaN
170,50.81,10.00,Male,Yes,Sat,Dinner,3.0,16.94,Gregory Clark,5.473851e+15,Sat1954,NaN
173,31.85,3.18,Male,Yes,Sun,Dinner,2.0,15.92,Scott Perez,3.577116e+15,Sun9335,NaN
175,32.90,3.11,Male,Yes,Sun,Dinner,2.0,16.45,Nathan Reynolds,3.703070e+14,Sun5109,NaN
179,34.63,3.55,Male,Yes,Sun,Dinner,2.0,17.32,Brian Bailey,3.466563e+14,Sun9851,NaN
180,34.65,3.68,Male,Yes,Sun,Dinner,4.0,8.66,James Hebert DDS,6.761687e+11,Sun7544,NaN
182,45.35,3.50,Male,Yes,Sun,Dinner,3.0,15.12,Jose Parsons,4.112208e+15,Sun2337,NaN
184,40.55,3.00,Male,Yes,Sun,Dinner,2.0,20.27,Stephen Cox,3.547798e+15,Sun5140,NaN
187,30.46,2.00,Male,Yes,Sun,Dinner,5.0,6.09,David Barrett,4.792883e+15,Sun9987,NaN
207,38.73,3.00,Male,Yes,Sat,Dinner,4.0,9.68,Ricky Ramirez,3.478180e+14,Sat4505,NaN
210,30.06,2.00,Male,Yes,Sat,Dinner,3.0,10.02,Shawn Mendoza,3.018405e+13,Sat8361,NaN
212,48.33,9.00,Male,No,Sat,Dinner,4.0,12.08,Alex Williamson,6.762188e+11,Sat4590,NaN
237,32.83,1.17,Male,Yes,Sat,Dinner,2.0,16.42,Thomas Brown,4.284723e+15,Sat2929,NaN

In [109]:
options = ['Sat', 'Sun']
df[df['day'].isin(options)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,0
0,16.99,1.01,Female,No,Sun,Dinner,2.0,8.49,Christy Cunningham,3.560325e+15,Sun2959,NaN
1,10.34,1.66,Male,No,Sun,Dinner,3.0,3.45,Douglas Tucker,4.478071e+15,Sun4608,NaN
2,21.01,3.50,Male,No,Sun,Dinner,3.0,7.00,Travis Walters,6.011812e+15,Sun4458,NaN
3,23.68,3.31,Male,No,Sun,Dinner,2.0,11.84,Nathaniel Harris,4.676138e+15,Sun5260,NaN
4,24.59,3.61,Female,No,Sun,Dinner,4.0,6.15,Tonya Carter,4.832733e+15,Sun2251,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3.0,11.94,Kimberly Crane,6.761840e+11,Sat9777,NaN
239,29.03,5.92,Male,No,Sat,Dinner,3.0,9.68,Michael Avila,5.296069e+15,Sat2657,NaN
240,27.18,2.00,Female,Yes,Sat,Dinner,2.0,13.59,Monica Sanders,3.506806e+15,Sat1766,NaN
241,22.67,2.00,Male,Yes,Sat,Dinner,2.0,11.34,Keith Wong,6.011892e+15,Sat3880,NaN
242,17.82,1.75,Male,No,Sat,Dinner,2.0,8.91,Dennis Dixon,4.375221e+12,Sat17,NaN